[
    {
      "urdu": "زمین کے سفر میں اگر کوئی چیز آسمانی ہے تو وہ محبت ہے۔",
      "transliteration": "zameen ke safar mei agar koi cheez aasmani hai to woh mohabbat hai.",
      "translation": "If there is anything heavenly in this journey of earth, it is love."
    },
    {
      "urdu": "ستاروں سے آگے جہاں اور بھی ہیں ابھی عشق کے امتحاں اور بھی ہیں۔",
      "transliteration": "sitaron se aagey jahan aur bhi hain abhi ishq ke imtihaan aur bhi hain.",
      "translation": "There are places beyond the stars, more tests of love remain."
    },
    {
      "urdu": "محبت وہ خوشبو ہے جو لفظوں سے نہیں، احساس سے محسوس ہوتی ہے۔",
      "transliteration": "mohabbat woh khushboo hai jo lafzon se nahi, ehsas se mehsoos hoti hai.",
      "translation": "Love is a fragrance felt not through words, but through feelings."
    },
    {
      "urdu": "تیرا نام لبوں پر آتے ہی دل مسکرا دیتا ہے۔",
      "transliteration": "tera naam labon par aate hi dil muskara deta hai.",
      "translation": "My heart smiles the moment your name crosses my lips."
    },
    {
      "urdu": "تم جو ساتھ ہو تو کچھ بھی ناممکن نہیں لگتا۔",
      "transliteration": "tum jo saath ho to kuch bhi namumkin nahi lagta.",
      "translation": "With you beside me, nothing feels impossible."
    },
    {
      "urdu": "محبت صرف نظر سے نہیں، دل کی آنکھ سے محسوس ہوتی ہے۔",
      "transliteration": "mohabbat sirf nazar se nahi, dil ki aankh se mehsoos hoti hai.",
      "translation": "Love is not seen through eyes, but felt through the heart’s gaze."
    },
    {
      "urdu": "تمہارے بغیر وقت رک سا جاتا ہے۔",
      "transliteration": "tumhare baghair waqt ruk sa jaata hai.",
      "translation": "Time seems to stop without you."
    },
    {
      "urdu": "میری ہر دعا میں تم ہو، ہر خواب میں تمہارا عکس۔",
      "transliteration": "meri har dua mein tum ho, har khwab mein tumhara aks.",
      "translation": "You are in every prayer of mine, and a reflection in every dream."
    },
    {
      "urdu": "محبت ایک خاموش دعا ہے، جو صرف دل سے نکلتی ہے۔",
      "transliteration": "mohabbat aik khamosh dua hai, jo sirf dil se nikalti hai.",
      "translation": "Love is a silent prayer, whispered only by the heart."
    },
    {
      "urdu": "تم مل جاؤ تو زندگی مکمل لگتی ہے۔",
      "transliteration": "tum mil jao to zindagi mukammal lagti hai.",
      "translation": "Life feels complete when I have you."
    },
    {
      "urdu": "دل کی ہر دھڑکن میں تمہارا نام بسا ہے۔",
      "transliteration": "dil ki har dhadkan mein tumhara naam basa hai.",
      "translation": "Your name echoes in every beat of my heart."
    },
    {
      "urdu": "تم ہو تو سب کچھ ہے، تم نہ ہو تو کچھ بھی نہیں۔",
      "transliteration": "tum ho to sab kuch hai, tum na ho to kuch bhi nahi.",
      "translation": "With you, I have everything. Without you, I have nothing."
    },
    {
      "urdu": "محبت میں لفظوں کی نہیں، احساس کی ضرورت ہوتی ہے۔",
      "transliteration": "mohabbat mein lafzon ki nahi, ehsas ki zarurat hoti hai.",
      "translation": "Love doesn't need words—it needs feelings."
    },
    {
      "urdu": "چاہت وہ نہیں جو دنیا کو دکھائی جائے، چاہت وہ ہے جو دل میں بسائی جائے۔",
      "transliteration": "chahat woh nahi jo duniya ko dikhayi jaye, chahat woh hai jo dil mein basayi jaye.",
      "translation": "True love isn’t for show—it lives in the heart."
    },
    {
      "urdu": "تمہاری مسکراہٹ میرے دل کی سب سے بڑی خوشی ہے۔",
      "transliteration": "tumhari muskurahat mere dil ki sabse badi khushi hai.",
      "translation": "Your smile is the greatest joy of my heart."
    },
    {
      "urdu": "تمہاری آنکھوں میں وہ جادو ہے جو دل کو قید کر لیتا ہے۔",
      "transliteration": "tumhari aankhon mein woh jadoo hai jo dil ko qaid kar leta hai.",
      "translation": "Your eyes hold the magic that captivates my heart."
    },
    {
      "urdu": "محبت وہ جذبہ ہے جو ہر فاصلے کو مٹا دیتا ہے۔",
      "transliteration": "mohabbat woh jazba hai jo har faaslay ko mita deta hai.",
      "translation": "Love is the feeling that erases all distance."
    },
    {
      "urdu": "دل کرتا ہے وقت رک جائے، جب تم پاس ہوتے ہو۔",
      "transliteration": "dil karta hai waqt ruk jaye, jab tum paas hotay ho.",
      "translation": "I wish time would freeze when you are near."
    },
    {
      "urdu": "تم میرے دل کی وہ خواہش ہو جو کبھی الفاظ میں بیان نہ ہو سکی۔",
      "transliteration": "tum mere dil ki woh khwahish ho jo kabhi alfaaz mein bayan na ho saki.",
      "translation": "You’re the desire of my heart that words could never express."
    },
    {
      "urdu": "تمہاری ہر بات دل کو چھو لیتی ہے۔",
      "transliteration": "tumhari har baat dil ko choo leti hai.",
      "translation": "Everything you say touches my heart."
    },
    {
      "urdu": "تمہیں دیکھ کر دل کو جو سکون ملتا ہے، وہ کہیں اور نہیں۔",
      "transliteration": "tumhein dekh kar dil ko jo sukoon milta hai, woh kahin aur nahi.",
      "translation": "The peace I feel when I see you—I find it nowhere else."
    },
    {
      "urdu": "محبت ایک روشنی ہے، جو اندھیروں میں بھی راستہ دکھاتی ہے۔",
      "transliteration": "mohabbat aik roshni hai, jo andheron mein bhi rasta dikhati hai.",
      "translation": "Love is a light that guides even in darkness."
    },
    {
      "urdu": "دل تمہارے بغیر ادھورا لگتا ہے۔",
      "transliteration": "dil tumhare baghair adhoora lagta hai.",
      "translation": "My heart feels incomplete without you."
    },
    {
      "urdu": "محبت وہ خزانہ ہے جو جتنا بانٹو، اتنا بڑھتا ہے۔",
      "transliteration": "mohabbat woh khazana hai jo jitna baanto, utna barhta hai.",
      "translation": "Love is a treasure—the more you share it, the more it grows."
    },
    {
      "urdu": "جب تم ساتھ ہوتے ہو تو ہر لمحہ خاص بن جاتا ہے۔",
      "transliteration": "jab tum saath hotay ho to har lamha khaas ban jaata hai.",
      "translation": "Every moment becomes special when you are with me."
    },
    {
      "urdu": "تمہاری یادوں کا سہارا ہے جو زندگی کو خوبصورت بناتا ہے۔",
      "transliteration": "tumhari yaadon ka sahara hai jo zindagi ko khoobsurat banata hai.",
      "translation": "It’s the memories of you that make life beautiful."
    },
    {
      "urdu": "تمہارے ساتھ گزرے لمحے میری زندگی کی سب سے قیمتی یادیں ہیں۔",
      "transliteration": "tumhare saath guzray lamhe meri zindagi ki sabse qeemti yaadein hain.",
      "translation": "The moments spent with you are my life’s most precious memories."
    },
    {
      "urdu": "محبت وہ احساس ہے جو ہمیشہ دل میں زندہ رہتا ہے۔",
      "transliteration": "mohabbat woh ehsas hai jo hamesha dil mein zinda rehta hai.",
      "translation": "Love is a feeling that always lives in the heart."
    }
  ]