[
    {
      "urdu": "وقت کبھی کسی کا انتظار نہیں کرتا۔",
      "transliteration": "waqt kabhi kisi ka intezar nahi karta.",
      "translation": "Time waits for no one."
    },
    {
      "urdu": "خاموشی بہت کچھ کہہ جاتی ہے، سننے والا ہونا شرط ہے۔",
      "transliteration": "khamoshi bohot kuch keh jaati hai, sunne wala hona shart hai.",
      "translation": "Silence says a lot—if only there’s someone who truly listens."
    },
    {
      "urdu": "جو جھک جاتا ہے، وہ سب کچھ سمیٹ لیتا ہے۔",
      "transliteration": "jo jhuk jaata hai, woh sab kuch samait leta hai.",
      "translation": "The one who bows down often gathers the most."
    },
    {
      "urdu": "علم دولت سے بہتر ہے، کیونکہ علم انسان کو انسان بناتا ہے۔",
      "transliteration": "ilm daulat se behtar hai, kyunki ilm insaan ko insaan banata hai.",
      "translation": "Knowledge is better than wealth, for it shapes one’s character."
    },
    {
      "urdu": "جو شخص اپنی غلطیوں سے سیکھے، وہی عقلمند کہلاتا ہے۔",
      "transliteration": "jo shakhs apni ghaltiyon se seekhe, wohi aqalmand kehlata hai.",
      "translation": "A wise person learns from their mistakes."
    },
    {
      "urdu": "رشتہ اگر دل سے ہو تو فاصلہ معنی نہیں رکھتا۔",
      "transliteration": "rishta agar dil se ho to faasla ma'ani nahi rakhta.",
      "translation": "When a bond is from the heart, distance doesn’t matter."
    },
    {
      "urdu": "غرور انسان کو اندھا کر دیتا ہے۔",
      "transliteration": "ghuroor insaan ko andha kar deta hai.",
      "translation": "Arrogance blinds a person."
    },
    {
      "urdu": "صبر کا پھل ہمیشہ میٹھا ہوتا ہے۔",
      "transliteration": "sabr ka phal hamesha meetha hota hai.",
      "translation": "The fruit of patience is always sweet."
    },
    {
      "urdu": "وقت اور حالات کبھی بھی ایک جیسے نہیں رہتے۔",
      "transliteration": "waqt aur halaat kabhi bhi aik jaise nahi rehte.",
      "translation": "Time and circumstances never stay the same."
    },
    {
      "urdu": "زبان کا زخم تلوار سے بھی گہرا ہوتا ہے۔",
      "transliteration": "zabaan ka zakham talwar se bhi gehra hota hai.",
      "translation": "A wound from the tongue cuts deeper than a sword."
    },
    {
      "urdu": "نیکی کر دریا میں ڈال۔",
      "transliteration": "neki kar darya mein daal.",
      "translation": "Do good and forget about it."
    },
    {
      "urdu": "جسے خود پر یقین نہ ہو، وہ دوسروں پر بھی شک کرتا ہے۔",
      "transliteration": "jise khud par yaqeen na ho, woh doosron par bhi shak karta hai.",
      "translation": "One who doesn’t believe in themselves doubts everyone else too."
    },
    {
      "urdu": "خوشی بانٹنے سے بڑھتی ہے، غم بانٹنے سے کم ہوتا ہے۔",
      "transliteration": "khushi baantne se barhti hai, gham baantne se kam hota hai.",
      "translation": "Joy increases when shared, sorrow lessens when shared."
    },
    {
      "urdu": "علم وہ دولت ہے جو چوری نہیں ہو سکتی۔",
      "transliteration": "ilm woh daulat hai jo chori nahi ho sakti.",
      "translation": "Knowledge is the wealth that can never be stolen."
    },
    {
      "urdu": "اچھے وقت کی قدر کرو، کیونکہ برا وقت بغیر اطلاع کے آتا ہے۔",
      "transliteration": "achay waqt ki qadr karo, kyunki bura waqt baghair ittila ke aata hai.",
      "translation": "Value the good times—bad times come without warning."
    },
    {
      "urdu": "ہر حال میں شکر کرنے والا کبھی ناکام نہیں ہوتا۔",
      "transliteration": "har haal mein shukar karne wala kabhi nakaam nahi hota.",
      "translation": "One who is thankful in every situation never fails."
    },
    {
      "urdu": "جو شخص خود کو بدل لے، وہ دنیا کو بھی بدل سکتا ہے۔",
      "transliteration": "jo shakhs khud ko badal le, woh duniya ko bhi badal sakta hai.",
      "translation": "He who changes himself can change the world."
    },
    {
      "urdu": "انسان کی پہچان اس کے اخلاق سے ہوتی ہے، لباس سے نہیں۔",
      "transliteration": "insaan ki pehchaan us ke ikhlaaq se hoti hai, libaas se nahi.",
      "translation": "A person is recognized by their manners, not by clothes."
    },
    {
      "urdu": "اگر نیت صاف ہو تو راستے خود بخود بنتے ہیں۔",
      "transliteration": "agar niyat saaf ho to raste khud ba khud bante hain.",
      "translation": "When the intention is pure, paths create themselves."
    },
    {
      "urdu": "خاموشی بھی کبھی کبھی بہترین جواب ہوتی ہے۔",
      "transliteration": "khamoshi bhi kabhi kabhi behtareen jawab hoti hai.",
      "translation": "Sometimes, silence is the best answer."
    },
    {
      "urdu": "دوست وہی جو مشکل وقت میں ساتھ دے۔",
      "transliteration": "dost wohi jo mushkil waqt mein saath de.",
      "translation": "A true friend stands by you in hard times."
    },
    {
      "urdu": "بڑا وہی ہوتا ہے جو چھوٹوں کو معاف کرے۔",
      "transliteration": "bada wohi hota hai jo chhoton ko maaf kare.",
      "translation": "Great is the one who forgives those beneath him."
    },
    {
      "urdu": "سچ ہمیشہ کڑوا ہوتا ہے، مگر فائدہ مند۔",
      "transliteration": "sach hamesha karwa hota hai, magar faida mand.",
      "translation": "Truth is always bitter, but beneficial."
    },
    {
      "urdu": "عقل مند وہ ہے جو دوسروں کی غلطیوں سے سیکھے۔",
      "transliteration": "aqalmand woh hai jo doosron ki ghaltiyon se seekhe.",
      "translation": "Wise is the one who learns from others’ mistakes."
    },
    {
      "urdu": "دولت چھن جائے تو واپس آ سکتی ہے، وقت نہیں۔",
      "transliteration": "daulat chhin jaaye to wapas aa sakti hai, waqt nahi.",
      "translation": "Wealth can be regained—time cannot."
    },
    {
      "urdu": "جو شخص تکبر کرے، وہ کبھی عزت نہیں پاتا۔",
      "transliteration": "jo shakhs takabbur kare, woh kabhi izzat nahi paata.",
      "translation": "The arrogant never earn respect."
    },
    {
      "urdu": "نیکی کی جڑیں گہری ہوتی ہیں، اس کے پھل دیر سے آتے ہیں۔",
      "transliteration": "neki ki jarein gehri hoti hain, is ke phal der se aate hain.",
      "translation": "Goodness takes root deep—it bears fruit slowly."
    },
    {
      "urdu": "بدلہ لینے سے سکون نہیں ملتا، معاف کرنے سے ملتا ہے۔",
      "transliteration": "badla lene se sukoon nahi milta, maaf karne se milta hai.",
      "translation": "Peace comes not by revenge but by forgiveness."
    },
    {
      "urdu": "ہر چیز کا ایک وقت ہوتا ہے، صبر کرو۔",
      "transliteration": "har cheez ka aik waqt hota hai, sabr karo.",
      "translation": "Everything happens at its time—have patience."
    },
    {
      "urdu": "جب انسان خود کو جان لیتا ہے، تو دنیا کی حقیقت بھی سمجھ لیتا ہے۔",
      "transliteration": "jab insaan khud ko jaan leta hai, to duniya ki haqeeqat bhi samajh leta hai.",
      "translation": "When one understands themselves, they understand the reality of the world."
    }
  ]